app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2018-06-08 21:53:42.895718"], ["updated_at", "2018-06-08 21:53:42.895718"]]
---
  def create
    @post = Post.new(post_params)
    if @post.save